In [1]:
import pandas as pd
import numpy as np
import operator

In [2]:
import os
import dask
import dask.dataframe as dd

In [3]:
from prep import accounts_csvs
# генерация искуственного набора данных:
accounts_csvs(6, 1000000, 500)

1) В account.*.csv найти имя, для которого встречается наибольшее количество положительных значений в стоблце amount

In [4]:
filename = os.path.join('data', 'accounts.*.csv')
filename

'data\\accounts.*.csv'

In [5]:
df = dd.read_csv(filename)

In [6]:
df.head()

    id   names  amount
0  185  Victor    2556
1  185  Victor    2461
2  487   Frank    -524
3   47   Sarah     724
4  190   Quinn      74

In [7]:
df.amount.compute()

0         2556
1         2461
2         -524
3          724
4           74
5         3110
6          258
7          453
8         3838
9          266
10        1576
11         346
12         462
13        5461
14         688
15        -112
16         704
17        4115
18         578
19           5
20        3945
21        1699
22         118
23        -613
24         498
25        3496
26         380
27        -594
28          24
29         604
          ...
999970    3615
999971      29
999972     143
999973    2069
999974   -1109
999975   -1028
999976    3160
999977    3514
999978    -209
999979      -8
999980     129
999981      75
999982     714
999983    -244
999984    2499
999985     204
999986     509
999987    2904
999988     233
999989     445
999990    1857
999991    2771
999992     -24
999993    4688
999994     186
999995     110
999996     360
999997    2814
999998     172
999999     142
Name: amount, Length: 6000000, dtype: int64

In [8]:
df.dtypes

id         int64
names     object
amount     int64
dtype: object

In [9]:
df = df[df.amount > 0]

In [10]:
res = df.groupby(df.names).amount.count().idxmax().compute()

In [11]:
res

'George'

2) Эффективно создать csv файлы, содержащие данные из файлов `accounts.*.csv` к которым добавлен столбец, в котором содержится количество сотен из положительного значения amount и 0, если значение в amount отрицательное. 

Пример:

`id,names,amount,new

412,Norbert,1492,14

498,Bob,-91,0

448,Ray,72,0`

In [12]:
filename = os.path.join('data', 'accounts.*.csv')
filename

'data\\accounts.*.csv'

## 1 споcоб

In [24]:
ddf = dd.read_csv(filename)

In [25]:
ddf['new'] = df['amount'] // 100

In [26]:
ddf.head()

    id   names  amount   new
0  185  Victor    2556  25.0
1  185  Victor    2461  24.0
2  487   Frank    -524   NaN
3   47   Sarah     724   7.0
4  190   Quinn      74   0.0

In [28]:
ddf['new'] = ddf['new'].where(ddf['new'] > 0, 0)

In [29]:
ddf.head()

    id   names  amount   new
0  185  Victor    2556  25.0
1  185  Victor    2461  24.0
2  487   Frank    -524   0.0
3   47   Sarah     724   7.0
4  190   Quinn      74   0.0

## 2 способ

In [75]:
ddf_2 = df.map_partitions(lambda df: df.assign(new = df.amount // 100), 
                  meta={'id': 'i4', 'names': 'object', 'amount': 'i4', 'new': 'i4'})

In [78]:
ddf_2 = ddf_2.assign(new = ddf_2.new.where(cond = ddf_2.new > 0, other=0))

In [79]:
ddf_2.head()

    id   names  amount  new
0  185  Victor    2556   25
1  185  Victor    2461   24
3   47   Sarah     724    7
4  190   Quinn      74    0
5   19  Ingrid    3110   31

3) Эффективно найти все 10 децилей для распределения значения amount.

In [30]:
import dask.array as da

In [31]:
da.percentile(df['amount'].values, q=list(range(10, 101, 10))).compute()

array([   77.,   168.,   284.,   447.,   648.,  1087.,  1716.,  2522.,
        3242., 14177.])

4) Нати 2 последовательно идующие транзакции имеющие наибольшую по модулю разность между значениями amount.

In [20]:
def diff_between_window(df, periods=1):
         before, after = (periods, 0) if periods > 0 else (0, -periods)
         return df.map_overlap(lambda df, periods=1: df.diff(periods),
                           periods, 0, periods=periods)

In [21]:
tr2 = diff_between_window(df['amount'], 1).abs().idxmax()
tr1 = tr2 - 1

In [22]:
dask.compute(tr1, tr2)

(22215, 22216)